In [1]:
import pandas as pd
import numpy as np

In [4]:
student_data = { # 딕셔너리 생성
    '이름' : ['민준','서연','도윤','예은','시우'],
    '나이' : [18,17,18,17,18],
    '도시' : ['서울','부산','서울','인천','부산'],
    '국어' : [85,92,78,95,88],
    '수학' : [90,88,93,76,82]
}

df = pd.DataFrame(student_data)
df

   이름  나이  도시  국어  수학
0  민준  18  서울  85  90
1  서연  17  부산  92  88
2  도윤  18  서울  78  93
3  예은  17  인천  95  76
4  시우  18  부산  88  82

In [13]:
 #데이터 선택 및 필터링 정리
 #1.loc[행,열] :레이블 기반으로 행,열 선택
 #2.iloc[행,열]: 정수인덱스 기반으로 행,열 선택
 #3.query(문자열 조건식)
 query ='도시=="서울" and 국어 >=80'
 df.query(query)
 #4.isin(리스트):반드시 리스트여야함 , return: boolean Series
 #서울, 인천 학생 조회
 df['도시'].isin(['서울','인천'])
 df[ df['도시'].isin(['서울','인천'])]
 df[ df['도시'].isin(['서울'])]
 #5.filter - 특정컬럼선택
 df.filter(like='이')

   이름  나이
0  민준  18
1  서연  17
2  도윤  18
3  예은  17
4  시우  18

In [24]:
#3.DataFrame object Method:데이터 정렬 및 변경
#3.1 sort_values(by="컬럼명", ascending=True): 특정 컬림 기준 정렬시 사용


# 이름	나이	도시	국어	수학
# 0	민준	18	서울	85	90
# 1	서연	17	부산	92	88
# 2	도윤	18	서울	78	93
# 3	예은	17	인천	95	76
# 4	시우	18	부산	88	82

df.sort_values(by="국어")
df.sort_values(by='국어', ascending=False)
df[['이름','국어']].sort_values(by=['이름','국어'])
# '이름'기준으로 먼저 정렬, 그다음 국어 점수기준으로 정렬

#3.2sort_index()
# df.sort_index(ascending=False)
df.sort_index(axis=1)

   국어  나이  도시  수학  이름
0  85  18  서울  90  민준
1  92  17  부산  88  서연
2  78  18  서울  93  도윤
3  95  17  인천  76  예은
4  88  18  부산  82  시우